       *> setup the identification division
       IDENTIFICATION DIVISION.
        *> setup the program id
        PROGRAM-ID.  HELLO-WORLD.
        *> setup the author
        AUTHOR. Manuel Gomes Rosmaninho.
        *> setup the date written
        DATE-WRITTEN. 24/05/24. 
        *> setup the date compiled
        DATE-COMPILED. 24/05/24.
      ****************************************************************
      * DESCRIPTION: THE HELLO-WORLD PROGRAM.
      ****************************************************************
       *> setup the environment division
       ENVIRONMENT DIVISION.
       *> setup the data division
       DATA DIVISION.
       *> setup the procedure division
       PROCEDURE DIVISION.
           *> print a string
           DISPLAY "Hello, world!".
           *> stop the program
           STOP RUN.