       IDENTIFICATION DIVISION.
        PROGRAM-ID.  HELLO-WORLD.
        AUTHOR. Manuel Gomes Rosmaninho.
        DATE-WRITTEN. 24/05/24. 
        DATE-COMPILED. 24/05/24.
      *
      * DESCRIPTION: THE HELLO-WORLD PROGRAM.
      *
       PROCEDURE DIVISION.
       A001-MAIN.
           DISPLAY "Hello, world!".
           STOP RUN.