       IDENTIFICATION DIVISION. *> Section for the program’s identification.
        PROGRAM-ID.  HELLO-WORLD. *> Program name.
        AUTHOR. Manuel Gomes Rosmaninho. *> Author name.
        DATE-WRITTEN. 24/06/24. *> Date the program was written.
        DATE-COMPILED. 24/06/24. *> Date the program was compiled.

       ENVIRONMENT DIVISION. *> Section for the program’s environment.

       DATA DIVISION. *> Section for the program’s data.

       PROCEDURE DIVISION. *> Section for the program’s logic.
           DISPLAY "Hello, world!". *> Display the string on the screen.
           STOP RUN. *> End program execution.